/* --------------------------------------------------------------------------------------*/
//							Підключаємо header файли SDL бібліотек.						   //
/* --------------------------------------------------------------------------------------*/
#include "win32\SDL\include\SDL.h"
//Бібліотека для роботи з картинками форматів PNG, JPG, JPEG ...
#include "win32\SDL\include\SDL_image.h"
//Бібліотека для роботи зі звуком.
#include "win32\SDL\include\SDL_mixer.h"
//Бібліотека для роботи зі шрифтами 
#include "win32\SDL\include\SDL_ttf.h"
/* --------------------------------------------------------------------------------------*/