/* --------------------------------------------------------------------------------------*/
//								Підключаємо власні бібліотеки.							   //
/* --------------------------------------------------------------------------------------*/
#include "Heart_of_the_bankomat.h"
/* --------------------------------------------------------------------------------------*/
// Головна функція програми
int main(int argc, char *argv[])
{	
	Heart_of_the_bankomat ATM;
	ATM.run_the_bankomat();
	// функція своє завдання виконала ( true )
	return 0;
}
/* --------------------------------------------------------------------------------------*/