// *************************************************************************************** //
/* --------------------------------------------------------------------------------------*/
//										Клас - Текст.									   //
/* --------------------------------------------------------------------------------------*/
// *************************************************************************************** //
#pragma once
#define _CRT_SECURE_NO_WARNINGS	
/* --------------------------------------------------------------------------------------*/
//									Підключаємо бібліотеки.								   //
/* --------------------------------------------------------------------------------------*/
#include <string>
#include <Windows.h>
#include <iostream>
// Підключаємо header файли SDL бібліотек.
#include "Headers_SDL.h"
// Підключаємо header файли OpenGL бібліотеки.
#include "Headers_OpenGL.h"
/* --------------------------------------------------------------------------------------*/
// Клас - Текст.
class Text
{
public:
	/* --------------------------------------------------------------------------------------*/
	// переклад числа в рядок
	std::string IntToStr(int i);
	// Допоміжна функція для відображення тексту
	void GlTxt(int sdl_dx, int sdl_dy, TTF_Font *font,
		SDL_Color textColor, const char text[], GLuint texture);
	/* Процедура для отрисовки затекстурірованного полігону в координатах x, y;
	розміром dX, dY; повернутому на delta градусів. щодо верхньої лівої точки,
	або - щодо центру. Цю процедуру зручно використовувати для малювання фонів
	або спрайтів / тайлів, текстура яких використовує все вихідне зображення цілком. */
	void DrawTXT(float x, float y, float dX, float dY, float delta, int center);
	// функція для відображення тексту
	//x, //y, , //dX ширина, області видимості , //dY висота, області видимості , //font, //delta, //center 
	void Draw_Text(float x, float y, float dX, float dY,
		TTF_Font *fonts,	//використовуваний *.ttf фонт
		std::string text,		// сам текст, що вводиться
		float delta, int center);
	/* --------------------------------------------------------------------------------------*/
};
/* --------------------------------------------------------------------------------------*/